NordicSemiconductor/nrfx/mdk/nrf54h20_enga_radiocore.h
#ifdef NRF_TRUSTZONE_NONSECURE                       /*!< Remap NRF_X_NS instances to NRF_X symbol for ease of use.            */
  #define NRF_RADIOCORE_UICR                      NRF_RADIOCORE_UICR_NS
  #define NRF_RADIOCORE_ETM                       NRF_RADIOCORE_ETM_NS
  #define NRF_RADIOCORE_MVDMA                     NRF_RADIOCORE_MVDMA_NS
  #define NRF_RADIOCORE_RAMC000                   NRF_RADIOCORE_RAMC000_NS
  #define NRF_RADIOCORE_MEMCONF                   NRF_RADIOCORE_MEMCONF_NS
  #define NRF_RADIOCORE_WDT010                    NRF_RADIOCORE_WDT010_NS
  #define NRF_RADIOCORE_WDT011                    NRF_RADIOCORE_WDT011_NS
  #define NRF_RADIOCORE_DPPIC020                  NRF_RADIOCORE_DPPIC020_NS
  #define NRF_RADIOCORE_EGU020                    NRF_RADIOCORE_EGU020_NS
  #define NRF_RADIOCORE_AAR020                    NRF_RADIOCORE_AAR020_NS
  #define NRF_RADIOCORE_CCM020                    NRF_RADIOCORE_CCM020_NS
  #define NRF_RADIOCORE_ECB020                    NRF_RADIOCORE_ECB020_NS
  #define NRF_RADIOCORE_TIMER020                  NRF_RADIOCORE_TIMER020_NS
  #define NRF_RADIOCORE_TIMER021                  NRF_RADIOCORE_TIMER021_NS
  #define NRF_RADIOCORE_TIMER022                  NRF_RADIOCORE_TIMER022_NS
  #define NRF_RADIOCORE_RTC                       NRF_RADIOCORE_RTC_NS
  #define NRF_RADIOCORE_RADIO                     NRF_RADIOCORE_RADIO_NS
  #define NRF_RADIOCORE_VPR                       NRF_RADIOCORE_VPR_NS
  #define NRF_RADIOCORE_RAMC001                   NRF_RADIOCORE_RAMC001_NS
  #define NRF_RADIOCORE_AAR030                    NRF_RADIOCORE_AAR030_NS
  #define NRF_RADIOCORE_CCM030                    NRF_RADIOCORE_CCM030_NS
  #define NRF_RADIOCORE_ECB030                    NRF_RADIOCORE_ECB030_NS
  #define NRF_RADIOCORE_IPCT                      NRF_RADIOCORE_IPCT_NS
  #define NRF_RADIOCORE_BELLBOARD                 NRF_RADIOCORE_BELLBOARD_NS
#else                                                /*!< Remap NRF_X_S instances to NRF_X symbol for ease of use.             */
  #define NRF_RADIOCORE_UICR                      NRF_RADIOCORE_UICR_NS
  #define NRF_RADIOCORE_ICACHEDATA                NRF_RADIOCORE_ICACHEDATA_S
  #define NRF_RADIOCORE_ICACHEINFO                NRF_RADIOCORE_ICACHEINFO_S
  #define NRF_RADIOCORE_DCACHEDATA                NRF_RADIOCORE_DCACHEDATA_S
  #define NRF_RADIOCORE_DCACHEINFO                NRF_RADIOCORE_DCACHEINFO_S
  #define NRF_RADIOCORE_ETM                       NRF_RADIOCORE_ETM_NS
  #define NRF_RADIOCORE_CTI                       NRF_RADIOCORE_CTI_S
  #define NRF_RADIOCORE_CPUC                      NRF_RADIOCORE_CPUC_S
  #define NRF_RADIOCORE_ICACHE                    NRF_RADIOCORE_ICACHE_S
  #define NRF_RADIOCORE_DCACHE                    NRF_RADIOCORE_DCACHE_S
  #define NRF_RADIOCORE_SPU000                    NRF_RADIOCORE_SPU000_S
  #define NRF_RADIOCORE_MPC                       NRF_RADIOCORE_MPC_S
  #define NRF_RADIOCORE_MVDMA                     NRF_RADIOCORE_MVDMA_S
  #define NRF_RADIOCORE_RAMC000                   NRF_RADIOCORE_RAMC000_S
  #define NRF_RADIOCORE_HSFLL                     NRF_RADIOCORE_HSFLL_S
  #define NRF_RADIOCORE_LRCCONF000                NRF_RADIOCORE_LRCCONF000_S
  #define NRF_RADIOCORE_SPU010                    NRF_RADIOCORE_SPU010_S
  #define NRF_RADIOCORE_MEMCONF                   NRF_RADIOCORE_MEMCONF_S
  #define NRF_RADIOCORE_WDT010                    NRF_RADIOCORE_WDT010_S
  #define NRF_RADIOCORE_WDT011                    NRF_RADIOCORE_WDT011_S
  #define NRF_RADIOCORE_LRCCONF010                NRF_RADIOCORE_LRCCONF010_S
  #define NRF_RADIOCORE_RESETINFO                 NRF_RADIOCORE_RESETINFO_S
  #define NRF_RADIOCORE_SPU020                    NRF_RADIOCORE_SPU020_S
  #define NRF_RADIOCORE_DPPIC020                  NRF_RADIOCORE_DPPIC020_S
  #define NRF_RADIOCORE_PPIB020                   NRF_RADIOCORE_PPIB020_S
  #define NRF_RADIOCORE_EGU020                    NRF_RADIOCORE_EGU020_S
  #define NRF_RADIOCORE_AAR020                    NRF_RADIOCORE_AAR020_S
  #define NRF_RADIOCORE_CCM020                    NRF_RADIOCORE_CCM020_S
  #define NRF_RADIOCORE_ECB020                    NRF_RADIOCORE_ECB020_S
  #define NRF_RADIOCORE_TIMER020                  NRF_RADIOCORE_TIMER020_S
  #define NRF_RADIOCORE_TIMER021                  NRF_RADIOCORE_TIMER021_S
  #define NRF_RADIOCORE_TIMER022                  NRF_RADIOCORE_TIMER022_S
  #define NRF_RADIOCORE_RTC                       NRF_RADIOCORE_RTC_S
  #define NRF_RADIOCORE_RADIO                     NRF_RADIOCORE_RADIO_S
  #define NRF_RADIOCORE_LRCCONF020                NRF_RADIOCORE_LRCCONF020_S
  #define NRF_RADIOCORE_SPU030                    NRF_RADIOCORE_SPU030_S
  #define NRF_RADIOCORE_PPIB030                   NRF_RADIOCORE_PPIB030_S
  #define NRF_RADIOCORE_VPR                       NRF_RADIOCORE_VPR_S
  #define NRF_RADIOCORE_RAMC001                   NRF_RADIOCORE_RAMC001_S
  #define NRF_RADIOCORE_AAR030                    NRF_RADIOCORE_AAR030_S
  #define NRF_RADIOCORE_CCM030                    NRF_RADIOCORE_CCM030_S
  #define NRF_RADIOCORE_ECB030                    NRF_RADIOCORE_ECB030_S
  #define NRF_RADIOCORE_IPCT                      NRF_RADIOCORE_IPCT_S
  #define NRF_RADIOCORE_BELLBOARD                 NRF_RADIOCORE_BELLBOARD_S
#endif                                               /*!<  NRF_TRUSTZONE_NONSECURE                                             */

/* =========================================================================================================================== */
/* ================                                  Local Domain Remapping                                  ================ */
/* =========================================================================================================================== */

#ifdef NRF_RADIOCORE                                 /*!< Remap NRF_DOMAIN instances to NRF_X symbol for ease of use.          */
  #define NRF_UICR                                NRF_RADIOCORE_UICR
  #define NRF_ICACHEDATA                          NRF_RADIOCORE_ICACHEDATA
  #define NRF_ICACHEINFO                          NRF_RADIOCORE_ICACHEINFO
  #define NRF_DCACHEDATA                          NRF_RADIOCORE_DCACHEDATA
  #define NRF_DCACHEINFO                          NRF_RADIOCORE_DCACHEINFO
  #define NRF_ETM                                 NRF_RADIOCORE_ETM
  #define NRF_CTI                                 NRF_RADIOCORE_CTI
  #define NRF_CPUC                                NRF_RADIOCORE_CPUC
  #define NRF_ICACHE                              NRF_RADIOCORE_ICACHE
  #define NRF_DCACHE                              NRF_RADIOCORE_DCACHE
  #define NRF_SPU000                              NRF_RADIOCORE_SPU000
  #define NRF_MPC                                 NRF_RADIOCORE_MPC
  #define NRF_MVDMA                               NRF_RADIOCORE_MVDMA
  #define NRF_RAMC000                             NRF_RADIOCORE_RAMC000
  #define NRF_HSFLL                               NRF_RADIOCORE_HSFLL
  #define NRF_LRCCONF000                          NRF_RADIOCORE_LRCCONF000
  #define NRF_SPU010                              NRF_RADIOCORE_SPU010
  #define NRF_MEMCONF                             NRF_RADIOCORE_MEMCONF
  #define NRF_WDT010                              NRF_RADIOCORE_WDT010
  #define NRF_WDT011                              NRF_RADIOCORE_WDT011
  #define NRF_LRCCONF010                          NRF_RADIOCORE_LRCCONF010
  #define NRF_RESETINFO                           NRF_RADIOCORE_RESETINFO
  #define NRF_SPU020                              NRF_RADIOCORE_SPU020
  #define NRF_DPPIC020                            NRF_RADIOCORE_DPPIC020
  #define NRF_PPIB020                             NRF_RADIOCORE_PPIB020
  #define NRF_EGU020                              NRF_RADIOCORE_EGU020
  #define NRF_AAR020                              NRF_RADIOCORE_AAR020
  #define NRF_CCM020                              NRF_RADIOCORE_CCM020
  #define NRF_ECB020                              NRF_RADIOCORE_ECB020
  #define NRF_TIMER020                            NRF_RADIOCORE_TIMER020
  #define NRF_TIMER021                            NRF_RADIOCORE_TIMER021
  #define NRF_TIMER022                            NRF_RADIOCORE_TIMER022
  #define NRF_RTC                                 NRF_RADIOCORE_RTC
  #define NRF_RADIO                               NRF_RADIOCORE_RADIO
  #define NRF_LRCCONF020                          NRF_RADIOCORE_LRCCONF020
  #define NRF_SPU030                              NRF_RADIOCORE_SPU030
  #define NRF_PPIB030                             NRF_RADIOCORE_PPIB030
  #define NRF_VPR                                 NRF_RADIOCORE_VPR
  #define NRF_RAMC001                             NRF_RADIOCORE_RAMC001
  #define NRF_AAR030                              NRF_RADIOCORE_AAR030
  #define NRF_CCM030                              NRF_RADIOCORE_CCM030
  #define NRF_ECB030                              NRF_RADIOCORE_ECB030
  #define NRF_IPCT                                NRF_RADIOCORE_IPCT
  #define NRF_BELLBOARD                           NRF_RADIOCORE_BELLBOARD
#endif                                               /*!< NRF_RADIOCORE                                                        */

/* ========================================== End of section using anonymous unions ========================================== */

#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


#ifdef __cplusplus
}
#endif
#endif /* NRF54H20_ENGA_RADIOCORE_H */

